Given two lists
- [53, 43, 11, 91, 35, 67, 60, 59, 6, 31]
- [52, 84, 87, 83, 4, 98, 46, 31, 97, 3]

Create a list with the sum
- [105, 127, 98, 174, 39, 165, 106, 90, 103, 34]

First using Python lists then with Pandas

In [4]:
l1 = [53, 43, 11, 91, 35, 67, 60, 59, 6, 31]
l2 = [52, 84, 87, 83, 4, 98, 46, 31, 97, 3]

In [32]:
def pairwise_sum(l1, l2):
    if len(l1) != len(l2):
        # return None
        raise Exception("Lists not same size/length")
    l3 = [0]*len(l1)
    for i in range(len(l1)):
        l3[i] = l1[i] + l2[i]
    return l3

In [25]:
pairwise_sum(l1, l2)

[105, 127, 98, 174, 39, 165, 106, 90, 103, 34]

In [27]:
r = pairwise_sum([1, 2, 3, 4], [2, 3, 4])

In [31]:
if r == None:
    print("None result")
else:
    print("Okay")

None result

### DataFrame

In [33]:
import pandas as pd

In [34]:
df = pd.DataFrame([l1, l2])

In [35]:
df

    0   1   2   3   4   5   6   7   8   9
0  53  43  11  91  35  67  60  59   6  31
1  52  84  87  83   4  98  46  31  97   3

In [36]:
df.sum()

0    105
1    127
2     98
3    174
4     39
5    165
6    106
7     90
8    103
9     34
dtype: int64

In [37]:
l3

[105, 127, 98, 174, 39, 165, 106, 90, 103, 34]

In [41]:
df2 = pd.DataFrame([[1, 2 ,3], [2, 3, 4, 4]])

In [42]:
df2

   0  1  2    3
0  1  2  3  NaN
1  2  3  4  4.0

In [45]:
dft = df.transpose()

In [44]:
df

    0   1   2   3   4   5   6   7   8   9
0  53  43  11  91  35  67  60  59   6  31
1  52  84  87  83   4  98  46  31  97   3

In [46]:
dft

    0   1
0  53  52
1  43  84
2  11  87
3  91  83
4  35   4
5  67  98
6  60  46
7  59  31
8   6  97
9  31   3

In [47]:
dft['c'] = dft[0] + dft[1]

In [48]:
dft

    0   1    c
0  53  52  105
1  43  84  127
2  11  87   98
3  91  83  174
4  35   4   39
5  67  98  165
6  60  46  106
7  59  31   90
8   6  97  103
9  31   3   34

In [49]:
df3 = pd.DataFrame({'a': l1, 'b': l2})

In [50]:
df3

    a   b
0  53  52
1  43  84
2  11  87
3  91  83
4  35   4
5  67  98
6  60  46
7  59  31
8   6  97
9  31   3

In [51]:
df3['c'] = df3['a'] + df3['b']

In [52]:
df3

    a   b    c
0  53  52  105
1  43  84  127
2  11  87   98
3  91  83  174
4  35   4   39
5  67  98  165
6  60  46  106
7  59  31   90
8   6  97  103
9  31   3   34